In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('Dataset_ODI.csv')

In [4]:
df.head()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
0,ODI # 1,Australia,England,Australia,5 wickets,Melbourne,"Jan 5, 1971"
1,ODI # 2,England,Australia,England,6 wickets,Manchester,"Aug 24, 1972"
2,ODI # 3,England,Australia,Australia,5 wickets,Lord's,"Aug 26, 1972"
3,ODI # 4,England,Australia,England,2 wickets,Birmingham,"Aug 28, 1972"
4,ODI # 5,New Zealand,Pakistan,New Zealand,22 runs,Christchurch,"Feb 11, 1973"

In [5]:
df.tail()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
3927,ODI # 3928,India,New Zealand,New Zealand,6 wickets,Mumbai,"Oct 22, 2017"
3928,ODI # 3929,South Africa,Bangladesh,South Africa,200 runs,East London,"Oct 22, 2017"
3929,ODI # 3930,Pakistan,Sri Lanka,Pakistan,9 wickets,Sharjah,"Oct 23, 2017"
3930,ODI # 3931,India,New Zealand,India,6 wickets,Pune,"Oct 25, 2017"
3931,ODI # 3932,India,New Zealand,India,6 runs,Kanpur,"Oct 29, 2017"

In [9]:
df.describe()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
count,3932,3932,3932,3932,3753,3932,3932
unique,3932,24,25,25,227,173,3386
top,ODI # 3696,Australia,Sri Lanka,Australia,6 wickets,Sharjah,"Feb 4, 2007"
freq,1,583,508,555,347,228,6

In [88]:
df['Ground'].value_counts()

Sharjah           228
Dhaka             156
Sydney            154
Melbourne         147
Harare            136
                 ...
Albury              1
New Plymouth        1
Nairobi (Club)      1
Lucknow             1
Ballarat            1
Name: Ground, Length: 173, dtype: int64

In [89]:
df['Winner'].value_counts()

Australia       555
India           476
Pakistan        469
West Indies     380
Sri Lanka       372
South Africa    361
England         343
New Zealand     324
no result       140
Zimbabwe        129
Bangladesh      105
Ireland          51
Kenya            42
Afghanistan      42
tied             34
Scotland         31
Netherlands      28
Canada           17
U.A.E.            9
Bermuda           7
Hong Kong         6
P.N.G.            5
Asia XI           4
ICC World XI      1
Africa XI         1
Name: Winner, dtype: int64

In [90]:
df1 = df[df['Ground'] == 'Sharjah'] 
df1['Winner'].value_counts()

Pakistan        83
India           35
Sri Lanka       29
West Indies     19
Australia       14
South Africa    10
Afghanistan      9
New Zealand      9
Zimbabwe         8
England          8
tied             2
Canada           1
Netherlands      1
Name: Winner, dtype: int64

In [93]:
total_no_of_matched_played  = df['Team 1'].value_counts() + df['Team 2'].value_counts()
total_no_of_matched_played

Afghanistan      83.0
Africa XI         NaN
Asia XI           7.0
Australia       906.0
Bangladesh      335.0
Bermuda          35.0
Canada           77.0
East Africa       3.0
England         697.0
Hong Kong        18.0
ICC World XI      NaN
India           930.0
Ireland         123.0
Kenya           154.0
Namibia           6.0
Netherlands      76.0
New Zealand     731.0
P.N.G.           10.0
Pakistan        884.0
Scotland         93.0
South Africa    583.0
Sri Lanka       808.0
U.A.E.           35.0
U.S.A.            NaN
West Indies     767.0
Zimbabwe        491.0
dtype: float64

Average = df['Winner'].value_counts()/ total_no_of_matched_played

In [94]:
df['Match Date'].value_counts()

Feb 4, 2007     6
Jun 20, 1983    4
Jan 31, 2007    4
Jun 14, 1975    4
Jun 18, 1983    4
               ..
Oct 22, 1999    1
Jan 22, 1983    1
Feb 1, 2011     1
Mar 10, 1991    1
Jul 2, 2005     1
Name: Match Date, Length: 3386, dtype: int64

In [95]:
df1 = df[df['Winner'] == 'Australia']  

df1['Ground'].value_counts()

Sydney        85
Melbourne     74
Adelaide      34
Perth         29
Brisbane      23
              ..
Georgetown     1
Providence     1
Chandigarh     1
Worcester      1
Kochi          1
Name: Ground, Length: 97, dtype: int64

In [96]:
df1 = df[df['Ground'] == "Lord's"]   

df1['Winner'].value_counts()

England         23
Australia       12
West Indies      6
Sri Lanka        4
Pakistan         4
India            4
New Zealand      3
tied             2
no result        1
South Africa     1
Name: Winner, dtype: int64

In [98]:
df['Team 2'] == df['Winner'].sum()

0       False
1       False
2       False
3       False
4       False
        ...
3927    False
3928    False
3929    False
3930    False
3931    False
Name: Team 2, Length: 3932, dtype: bool

In [99]:
df1 = df[df['Team 2'] == df['Winner']]

df1['Winner'].value_counts()

Pakistan        245
West Indies     239
Sri Lanka       200
Australia       172
South Africa    167
India           161
England         122
New Zealand     117
Zimbabwe         71
Bangladesh       27
Afghanistan      22
Ireland          21
Netherlands      16
Scotland         16
Kenya            16
Canada            8
P.N.G.            4
Asia XI           4
Bermuda           4
U.A.E.            2
Hong Kong         2
ICC World XI      1
Name: Winner, dtype: int64

In [102]:
df2 = df[df['Match Date'] == 'Feb 4, 2007']
df2

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
2500,ODI # 2501,Australia,New Zealand,Australia,5 wickets,Melbourne,"Feb 4, 2007"
2501,ODI # 2502,Bermuda,Netherlands,Netherlands,8 wickets,Nairobi (Ruaraka),"Feb 4, 2007"
2502,ODI # 2503,Canada,Ireland,Canada,6 wickets,Nairobi (Jaff),"Feb 4, 2007"
2503,ODI # 2504,Kenya,Scotland,Scotland,77 runs,Nairobi (Gym),"Feb 4, 2007"
2504,ODI # 2505,Zimbabwe,Bangladesh,Bangladesh,45 runs,Harare,"Feb 4, 2007"
2505,ODI # 2506,South Africa,Pakistan,South Africa,164 runs,Centurion,"Feb 4, 2007"

In [27]:
ground = df["Ground"]
ground.describe()

count        3932
unique        173
top       Sharjah
freq          228
Name: Ground, dtype: object

In [21]:
matches = df["Scorecard"]
matches

0          ODI # 1
1          ODI # 2
2          ODI # 3
3          ODI # 4
4          ODI # 5
           ...
3927    ODI # 3928
3928    ODI # 3929
3929    ODI # 3930
3930    ODI # 3931
3931    ODI # 3932
Name: Scorecard, Length: 3932, dtype: object

In [22]:
max_matches_ground = df.count["ground" , "matches"]
max_matches_ground

TypeError: 'method' object is not subscriptable

In [30]:
winner = df["Winner"]
winner.describe()

count          3932
unique           25
top       Australia
freq            555
Name: Winner, dtype: object

In [39]:
most_sharjah_winner = df[["Winner","Ground"]]
most_sharjah_winner

            Winner        Ground
0        Australia     Melbourne
1          England    Manchester
2        Australia        Lord's
3          England    Birmingham
4      New Zealand  Christchurch
...            ...           ...
3927   New Zealand        Mumbai
3928  South Africa   East London
3929      Pakistan       Sharjah
3930         India          Pune
3931         India        Kanpur

[3932 rows x 2 columns]

In [55]:
most_sharjah_winner.describe()

           Winner   Ground
count        3932     3932
unique         25      173
top     Australia  Sharjah
freq          555      228

In [54]:
most_sharjah_winner.count('Ground')

ValueError: No axis named Ground for object type <class 'pandas.core.frame.DataFrame'>

In [69]:
winner.describe()

count          3932
unique           25
top       Australia
freq            555
Name: Winner, dtype: object

In [67]:
matchdate = df[["Match Date"]]
matchdate

        Match Date
0      Jan 5, 1971
1     Aug 24, 1972
2     Aug 26, 1972
3     Aug 28, 1972
4     Feb 11, 1973
...            ...
3927  Oct 22, 2017
3928  Oct 22, 2017
3929  Oct 23, 2017
3930  Oct 25, 2017
3931  Oct 29, 2017

[3932 rows x 1 columns]

In [68]:
matchdate.describe()

         Match Date
count          3932
unique         3386
top     Feb 4, 2007
freq              6

In [87]:
most_aus_win = df[["Winner"]] == 'Australia' 
most_aus_win.

Winner    3932
dtype: int64